renesas-rx/rx65n-envision-kit/rx65n_envisionkit/rx65n_secure_boot/src/src/rx65n_secure_boot.c
/***********************************************************************
*
*  FILE        : rx65n_2mb_rsk_secure_boot.c
*  DATE        : 2017-09-18
*  DESCRIPTION : Main Program
*
*  NOTE:THIS IS A TYPICAL EXAMPLE.
*
***********************************************************************/
#include <stdio.h>
#include <string.h>
#include "r_smc_entry.h"
#include "r_flash_rx_if.h"
#include "r_tfat_lib.h"
#include "r_usb_basic_if.h"
#include "r_usb_hmsc_if.h"
#include "Pin.h"
#include "base64_decode.h"
#include "r_cryptogram.h"
#include "r_simple_graphic_if.h"

#if SECURE_BOOT
#pragma section SECURE_BOOT
#endif

#define SECURE_BOOT_SUCCESS         (0)
#define SECURE_BOOT_FAIL            (-1)
#define SECURE_BOOT_GOTO_INSTALL    (-2)

#define LIFECYCLE_STATE_BLANK             (0)
#define LIFECYCLE_STATE_ON_THE_MARKET     (1)
#define LIFECYCLE_STATE_UPDATING          (2)

#define SECURE_BOOT_LO_BLOCK FLASH_CF_BLOCK_7
#define SECURE_BOOT_MIRROR_LO_BLOCK FLASH_CF_BLOCK_45
#define SECURE_BOOT_MIRROR_HI_BLOCK FLASH_CF_BLOCK_38
#define SECURE_BOOT_UPDATE_TEMPORARY_AREA FLASH_CF_LO_BANK_LO_ADDR
#define SECURE_BOOT_UPDATE_EXECUTE_AREA FLASH_CF_HI_BANK_LO_ADDR

#define SECURE_BOOT_MIRROR_BLOCK_NUM 8
#define SECURE_BOOT_PARAMETER_NUMBER 5

#define INITIAL_FIRMWARE_FILE_NAME "std.rsu"

#define MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT 3
#define SHA1_HASH_LENGTH_BYTE_SIZE 20

typedef struct _load_firmware_control_block {
    uint32_t flash_buffer[FLASH_CF_MEDIUM_BLOCK_SIZE / 4];
    uint32_t offset;
    uint32_t progress;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
    uint32_t firmware_length;
}LOAD_FIRMWARE_CONTROL_BLOCK;

typedef struct _firmware_update_control_block_sub
{
    uint32_t user_program_max_cnt;
    uint32_t lifecycle_state;
    uint8_t program_hash0[SHA1_HASH_LENGTH_BYTE_SIZE];
    uint8_t program_hash1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK_SUB;

typedef struct _firmware_update_control_block
{
    FIRMWARE_UPDATE_CONTROL_BLOCK_SUB data;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
}FIRMWARE_UPDATE_CONTROL_BLOCK;

void main(void);
static int32_t secure_boot(void);
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset);
static void bank_swap_with_software_reset(void);
static void update_dataflash_data_from_image(void);
static void update_dataflash_data_mirror_from_image(void);
static void check_dataflash_area(uint32_t retry_counter);
static void software_reset(void);

extern int32_t usb_main(void);
extern void lcd_open(void);
extern void lcd_close(void);

#define FIRMWARE_UPDATE_CONTROL_BLOCK_INITIAL_DATA \
        /* FIRMWARE_UPDATE_CONTROL_BLOCK_SUB data; */\
        {\
            /* uint32_t user_program_max_cnt; */\
            0,\
            /* uint32_t lifecycle_state; */\
            LIFECYCLE_STATE_BLANK,\
            /* uint8_t program_hash0[SHA1_HASH_LENGTH_BYTE_SIZE]; */\
            {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},\
            /* uint8_t program_hash1[SHA1_HASH_LENGTH_BYTE_SIZE]; */\
			{0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00},\
        },\
        /* uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE]; */\
        {0xc1, 0x7f, 0xd9, 0x26, 0x82, 0xca, 0x5b, 0x30, 0x4A, 0xc7, 0x10, 0x74, 0xb5, 0x58, 0xdd, 0xa9, 0xe8, 0xeb, 0x4d, 0x66},

#pragma section _FIRMWARE_UPDATE_CONTROL_BLOCK
static const FIRMWARE_UPDATE_CONTROL_BLOCK firmware_update_control_block_data = {FIRMWARE_UPDATE_CONTROL_BLOCK_INITIAL_DATA};
#pragma section

#pragma section _FIRMWARE_UPDATE_CONTROL_BLOCK_MIRROR
static const FIRMWARE_UPDATE_CONTROL_BLOCK firmware_update_control_block_data_mirror = {FIRMWARE_UPDATE_CONTROL_BLOCK_INITIAL_DATA};
#pragma section

static FIRMWARE_UPDATE_CONTROL_BLOCK firmware_update_control_block_image = {0};
static LOAD_FIRMWARE_CONTROL_BLOCK load_firmware_control_block;
static FATFS       g_fatfs;


#if SECURE_BOOT
#pragma section SECURE_BOOT
#endif

const char lifecycle_string[][64] = {
        {"LIFECYCLE_STATE_BLANK"},
        {"LIFECYCLE_STATE_ON_THE_MARKET"},
        {"LIFECYCLE_STATE_UPDATING"},
};

void main(void)
{
    int32_t result_secure_boot;
    static FILINFO filinfo;
    usb_ctrl_t  ctrl;
    usb_cfg_t   cfg;
    uint16_t    event;
    uint16_t    previous_event;
    flash_err_t flash_error_code = FLASH_SUCCESS;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
    R_Pins_Create();

    load_firmware_control_block.progress = 0;
    load_firmware_control_block.offset = 0;

    lcd_open();
    R_SIMPLE_GRAPHIC_Open();

    flash_error_code = R_FLASH_Open();
    if (FLASH_SUCCESS == flash_error_code)
    {
        /* nothing to do */
    }
    else
    {
        printf("R_FLASH_Open() returns error. %d.\r\n", flash_error_code);
        printf("system error.\r\n");
        while(1);
    }

    /* startup system */
    printf("-------------------------------------------------\r\n");
    printf("RX65N secure boot program\r\n");
    printf("-------------------------------------------------\r\n");

    printf("Checking data flash...\r\n");
    check_dataflash_area(0);
    printf("OK\r\n");

    memset(&firmware_update_control_block_image, 0, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));
    memcpy(&firmware_update_control_block_image, &firmware_update_control_block_data, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK));

    result_secure_boot = secure_boot();
    if (SECURE_BOOT_SUCCESS == result_secure_boot)
    {
        R_BSP_InterruptsDisable();
        R_SIMPLE_GRAPHIC_Close();
        lcd_close();
        return;
    }
    else if (SECURE_BOOT_GOTO_INSTALL == result_secure_boot)
    {
        /* Set up the USB */
        ctrl.module     = USB_IP0;
        ctrl.type       = USB_HMSC;
        cfg.usb_speed   = USB_FS;
        cfg.usb_mode    = USB_HOST;
        R_USB_Open(&ctrl, &cfg);


        printf("========== install user program phase ==========\r\n");
        printf("insert USB memory includes \"%s\"\r\n", INITIAL_FIRMWARE_FILE_NAME);
        while(1)
        {
            event = R_USB_GetEvent(&ctrl);
            if(event != previous_event)
            {
                if(event == USB_STS_CONFIGURED)
                {
                    R_tfat_f_mount(0, &g_fatfs);
                    printf("usb memory attached.\r\n");
                    if(TFAT_FR_OK == R_tfat_f_stat(INITIAL_FIRMWARE_FILE_NAME, &filinfo))
                    {
                        printf("Detected file. %s.\r\n", INITIAL_FIRMWARE_FILE_NAME);

                        printf("erase install area: ");
                        flash_error_code = R_FLASH_Erase((flash_block_address_t)FLASH_CF_BLOCK_46, 30);
                        if (FLASH_SUCCESS == flash_error_code)
                        {
                            printf("OK\r\n");
                        }
                        else
                        {
                            printf("R_FLASH_Erase() returns error. %d.\r\n", flash_error_code);
                            printf("system error.\r\n");
                            while(1);
                        }

                        while(1)
                        {
                            if(!firm_block_read(load_firmware_control_block.flash_buffer, load_firmware_control_block.offset))
                            {
                                R_FLASH_Write((uint32_t)load_firmware_control_block.flash_buffer, (uint32_t)SECURE_BOOT_UPDATE_TEMPORARY_AREA + load_firmware_control_block.offset, sizeof(load_firmware_control_block.flash_buffer));
                                load_firmware_control_block.offset += FLASH_CF_MEDIUM_BLOCK_SIZE;
                                load_firmware_control_block.progress = (uint32_t)(((float)(load_firmware_control_block.offset)/(float)((FLASH_CF_MEDIUM_BLOCK_SIZE * 30))*100));
                                printf("installing firmware...%d%(%d/%dKB).\r", load_firmware_control_block.progress, load_firmware_control_block.offset/1024, (FLASH_CF_MEDIUM_BLOCK_SIZE * 30)/1024);
                                if(load_firmware_control_block.offset < (FLASH_CF_MEDIUM_BLOCK_SIZE * 30))
                                {
                                    /* one more loop */
                                }
                                else if(load_firmware_control_block.offset == (FLASH_CF_MEDIUM_BLOCK_SIZE * 30))
                                {
                                    printf("\n");
                                    printf("completed installing.\r\n");
                                    break;
                                }
                                else
                                {
                                    printf("\n");
                                    printf("fatal error occurred.\r\n");
                                    break;
                                }
                            }
                            else
                            {
                                printf("\n");
                                printf("filesystem output error.\r\n");
                                break;
                            }
                        }
                        printf("code flash hash check...");
                        
