renesas-rx/rx65n-envision-kit/rx65n_envisionkit/rx65n_secure_boot/src/src/rx65n_secure_boot.c
                        R_Sha1((uint8_t*)SECURE_BOOT_UPDATE_TEMPORARY_AREA, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * 30);
                        if(0 == memcmp(hash_sha1, load_firmware_control_block.hash_sha1, SHA1_HASH_LENGTH_BYTE_SIZE))
                        {
                            printf("OK\r\n");

                            memcpy(firmware_update_control_block_image.data.program_hash1, hash_sha1, sizeof(hash_sha1));
                            firmware_update_control_block_image.data.lifecycle_state = LIFECYCLE_STATE_UPDATING;
                            firmware_update_control_block_image.data.user_program_max_cnt = load_firmware_control_block.firmware_length;

                            R_Sha1((uint8_t *)&firmware_update_control_block_image.data, hash_sha1, sizeof(firmware_update_control_block_image.data));
                            memcpy(firmware_update_control_block_image.hash_sha1, hash_sha1, sizeof(firmware_update_control_block_image.hash_sha1));
                            update_dataflash_data_from_image();
                            update_dataflash_data_mirror_from_image();

                            printf("swap bank...");
                            R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                            R_USB_Close(&ctrl);
                            R_SIMPLE_GRAPHIC_Close();
                            lcd_close();
                            bank_swap_with_software_reset();
                            while(1);
                        }
                        else
                        {
                            printf("NG\r\n");
                            while(1);
                        }
                    }
                    else
                    {
                        printf("File Not Found. %s.\r\n", INITIAL_FIRMWARE_FILE_NAME);
                    }
                }
                else if(event == USB_STS_DETACH)
                {
                    printf("usb memory detached.\r\n");
                }
            }
            previous_event = event;
        }
    }
    else if (SECURE_BOOT_FAIL == result_secure_boot)
    {
        printf("secure boot sequence:");
        printf("fail.");
        while(1)
        {
            /* infinity loop */
        }
    }
    else
    {
        printf("unknown status.\n");
        while(1)
        {
            /* infinite loop */
        }
    }
}

static int32_t secure_boot(void)
{
    flash_err_t flash_error_code = FLASH_SUCCESS;
    int32_t secure_boot_error_code;
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];
    uint32_t bank_info = 255;

    printf("Checking flash ROM status.\r\n");

    printf("status = %s\r\n", lifecycle_string[firmware_update_control_block_image.data.lifecycle_state]);

    R_FLASH_Control(FLASH_CMD_BANK_GET, &bank_info);
    printf("bank info = %d. (start bank = %d)\r\n", bank_info, (bank_info ^ 0x01));

    switch(firmware_update_control_block_image.data.lifecycle_state)
    {
        case LIFECYCLE_STATE_BLANK:
            printf("start installing user program.\r\n");
            printf("erase bank1 secure boot mirror area...");
            flash_error_code = R_FLASH_Erase(SECURE_BOOT_MIRROR_HI_BLOCK, SECURE_BOOT_MIRROR_BLOCK_NUM);
            if(FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("NG\r\n");
                printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
                secure_boot_error_code = SECURE_BOOT_FAIL;
                break;
            }

            printf("copy secure boot from bank0 to bank1...");
            flash_error_code = R_FLASH_Write((uint32_t)SECURE_BOOT_LO_BLOCK, (uint32_t)SECURE_BOOT_MIRROR_LO_BLOCK, (uint32_t)SECURE_BOOT_MIRROR_BLOCK_NUM * FLASH_CF_SMALL_BLOCK_SIZE);
            if(FLASH_SUCCESS == flash_error_code)
            {
                printf("OK\r\n");
            }
            else
            {
                printf("NG\r\n");
                printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
                secure_boot_error_code = SECURE_BOOT_FAIL;
                break;
            }
            secure_boot_error_code = SECURE_BOOT_GOTO_INSTALL;
            break;
        case LIFECYCLE_STATE_UPDATING:
            printf("update data flash\r\n");
            memcpy(hash_sha1, firmware_update_control_block_image.data.program_hash1, sizeof(hash_sha1));
            memcpy(firmware_update_control_block_image.data.program_hash1, firmware_update_control_block_image.data.program_hash0, sizeof(hash_sha1));
            memcpy(firmware_update_control_block_image.data.program_hash0, hash_sha1, sizeof(hash_sha1));
            firmware_update_control_block_image.data.lifecycle_state = LIFECYCLE_STATE_ON_THE_MARKET;

            R_Sha1((uint8_t *)&firmware_update_control_block_image.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
            memcpy(firmware_update_control_block_image.hash_sha1, hash_sha1, sizeof(hash_sha1));
            update_dataflash_data_from_image();
            update_dataflash_data_mirror_from_image();
            //break;    /* in this case, next state "LIFECYCLE_STATE_ON_THE_MARKET" is needed to execute */
        case LIFECYCLE_STATE_ON_THE_MARKET:
            check_dataflash_area(0);
            printf("code flash hash check...");
            R_Sha1((uint8_t*)SECURE_BOOT_UPDATE_EXECUTE_AREA, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * 30);
            if(!memcmp(firmware_update_control_block_data.data.program_hash0, hash_sha1, sizeof(hash_sha1)) || !memcmp(firmware_update_control_block_data.data.program_hash1, hash_sha1, sizeof(hash_sha1)))
            {
                printf("OK\r\n");
                printf("jump to user program\r\n");
                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                secure_boot_error_code = SECURE_BOOT_SUCCESS;
            }
            else
            {
                R_Sha1((uint8_t*)SECURE_BOOT_UPDATE_TEMPORARY_AREA, hash_sha1, FLASH_CF_MEDIUM_BLOCK_SIZE * 30);
                if(!memcmp(firmware_update_control_block_data.data.program_hash0, hash_sha1, sizeof(hash_sha1)) || !memcmp(firmware_update_control_block_data.data.program_hash1, hash_sha1, sizeof(hash_sha1)) )
                {
                    printf("NG.\r\n");
                    printf("But other bank %d is still alive.\r\n", (bank_info ^ 0x01) ^ 0x01);
                    printf("swap bank...");
                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                    bank_swap_with_software_reset();
                    while(1);
                }
                else
                {
                    printf("NG.\r\n");
                    printf("Code flash is completely broken.\r\n");
                    printf("Please erase all code flash.\r\n");
                    printf("And, write secure boot using debugger.\r\n");
                    secure_boot_error_code = SECURE_BOOT_FAIL;
                }
            }
            break;
        default:
            printf("illegal flash rom status code 0x%x.\r\n", firmware_update_control_block_image.data.lifecycle_state);
            check_dataflash_area(0);
            R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
            software_reset();
            while(1);
    }
    return secure_boot_error_code;
}

static void update_dataflash_data_from_image(void)
{
    uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
    if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
    {
        required_dataflash_block_num++;
    }

    printf("erase dataflash(main)...");
    flash_error_code = R_FLASH_Erase((flash_block_address_t)&firmware_update_control_block_data, required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
    }

    printf("write dataflash(main)...");
    flash_error_code = R_FLASH_Write((flash_block_address_t)&firmware_update_control_block_image, (flash_block_address_t)&firmware_update_control_block_data, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
        return;
    }
    return;
}

static void update_dataflash_data_mirror_from_image(void)
{
    uint32_t required_dataflash_block_num;
    flash_err_t flash_error_code = FLASH_SUCCESS;

    required_dataflash_block_num = sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) / FLASH_DF_BLOCK_SIZE;
    if(sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK) % FLASH_DF_BLOCK_SIZE)
    {
        required_dataflash_block_num++;
    }

    printf("erase dataflash(mirror)...");
    flash_error_code = R_FLASH_Erase((flash_block_address_t)&firmware_update_control_block_data_mirror, required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Erase() returns error code = %d.\r\n", flash_error_code);
        return;
    }

    printf("write dataflash(mirror)...");
    flash_error_code = R_FLASH_Write((flash_block_address_t)&firmware_update_control_block_image, (flash_block_address_t)&firmware_update_control_block_data_mirror, FLASH_DF_BLOCK_SIZE * required_dataflash_block_num);
    if(FLASH_SUCCESS == flash_error_code)
    {
        printf("OK\r\n");
    }
    else
    {
        printf("NG\r\n");
        printf("R_FLASH_Write() returns error code = %d.\r\n", flash_error_code);
        return;
    }
    if(!memcmp(&firmware_update_control_block_data, &firmware_update_control_block_data_mirror, sizeof(FIRMWARE_UPDATE_CONTROL_BLOCK)))
    {
        printf("data flash setting OK.\r\n");
    }
    else
    {
        printf("data flash setting NG.\r\n");
        return;
    }
    return;
}

static void check_dataflash_area(uint32_t retry_counter)
{
    uint8_t hash_sha1[SHA1_HASH_LENGTH_BYTE_SIZE];

    if(retry_counter)
    {
        printf("recover retry count = %d.\r\n", retry_counter);
        if(retry_counter == MAX_CHECK_DATAFLASH_AREA_RETRY_COUNT)
        {
            printf("retry over the limit.\r\n");
            while(1);
        }
    }
    printf("data flash(main) hash check...");
    R_Sha1((uint8_t *)&firmware_update_control_block_data.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
    if(!memcmp(firmware_update_control_block_data.hash_sha1, hash_sha1, sizeof(hash_sha1)))
    {
        printf("OK\r\n");
        printf("data flash(mirror) hash check...");
        R_Sha1((uint8_t *)&firmware_update_control_block_data_mirror.data, hash_sha1, sizeof(firmware_update_control_block_data.data));
        if(!memcmp(firmware_update_control_block_data_mirror.hash_sha1, hash_sha1, sizeof(hash_sha1)))
        {
            printf("OK\r\n");
        }
        else
        {
            printf("NG\r\n");
            printf("recover mirror from main.\r\n");
            memcpy(&firmware_update_control_block_image, &firmware_update_control_block_data, sizeof(firmware_update_control_block_data));
            update_dataflash_data_mirror_from_image();
            check_dataflash_area(retry_counter+1);
        }
    }
    else
    {
        printf("NG\r\n");
        printf("data flash(mirror) hash check...");
        R_Sha1((uint8_t *)&firmware_update_control_block_data_mirror.data, hash_sha1, sizeof(firmware_update_control_block_data_mirror.data));
        if(!memcmp(firmware_update_control_block_data_mirror.hash_sha1, hash_sha1, sizeof(hash_sha1)))
        {
            printf("OK\r\n");
            printf("recover main from mirror.\r\n");
            memcpy(&firmware_update_control_block_image, &firmware_update_control_block_data_mirror, sizeof(firmware_update_control_block_data_mirror));
            update_dataflash_data_from_image();
            check_dataflash_area(retry_counter+1);
        }
        else
        {
            printf("NG\r\n");
            printf("Data flash is completely broken.\r\n");
            printf("Please erase all code flash.\r\n");
            printf("And, write secure boot using debugger.\r\n");
            while(1);
        }
    }
}

